ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/ADC_ADC_RESULTS_50100000h.xml
<module name="ADC_RESULTS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ADC_RESULTS_ADCRESULT0" acronym="ADC_RESULTS_ADCRESULT0" offset="0" width="16" description="ADC Result 0 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 0  12-bit ADC result. After the ADC completes a conversion of SOC0, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT1" acronym="ADC_RESULTS_ADCRESULT1" offset="2" width="16" description="ADC Result 1 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 1  12-bit ADC result. After the ADC completes a conversion of SOC1, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT2" acronym="ADC_RESULTS_ADCRESULT2" offset="4" width="16" description="ADC Result 2 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 2  12-bit ADC result. After the ADC completes a conversion of SOC2, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT3" acronym="ADC_RESULTS_ADCRESULT3" offset="6" width="16" description="ADC Result 3 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 3  12-bit ADC result. After the ADC completes a conversion of SOC3, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT4" acronym="ADC_RESULTS_ADCRESULT4" offset="8" width="16" description="ADC Result 4 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 4  12-bit ADC result. After the ADC completes a conversion of SOC4, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT5" acronym="ADC_RESULTS_ADCRESULT5" offset="10" width="16" description="ADC Result 5 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 5  12-bit ADC result. After the ADC completes a conversion of SOC5, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT6" acronym="ADC_RESULTS_ADCRESULT6" offset="12" width="16" description="ADC Result 6 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 6  12-bit ADC result. After the ADC completes a conversion of SOC6, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT7" acronym="ADC_RESULTS_ADCRESULT7" offset="14" width="16" description="ADC Result 7 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 7  12-bit ADC result. After the ADC completes a conversion of SOC7, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT8" acronym="ADC_RESULTS_ADCRESULT8" offset="16" width="16" description="ADC Result 8 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 8  12-bit ADC result. After the ADC completes a conversion of SOC8, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT9" acronym="ADC_RESULTS_ADCRESULT9" offset="18" width="16" description="ADC Result 9 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 9  12-bit ADC result. After the ADC completes a conversion of SOC9, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT10" acronym="ADC_RESULTS_ADCRESULT10" offset="20" width="16" description="ADC Result 10 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 10  12-bit ADC result. After the ADC completes a conversion of SOC10, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT11" acronym="ADC_RESULTS_ADCRESULT11" offset="22" width="16" description="ADC Result 11 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 11  12-bit ADC result. After the ADC completes a conversion of SOC11, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT12" acronym="ADC_RESULTS_ADCRESULT12" offset="24" width="16" description="ADC Result 12 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 12  12-bit ADC result. After the ADC completes a conversion of SOC12, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT13" acronym="ADC_RESULTS_ADCRESULT13" offset="26" width="16" description="ADC Result 13 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 13  12-bit ADC result. After the ADC completes a conversion of SOC13, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT14" acronym="ADC_RESULTS_ADCRESULT14" offset="28" width="16" description="ADC Result 14 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 14  12-bit ADC result. After the ADC completes a conversion of SOC14, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCRESULT15" acronym="ADC_RESULTS_ADCRESULT15" offset="30" width="16" description="ADC Result 15 Register.">
		<bitfield id="RESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Result 15  12-bit ADC result. After the ADC completes a conversion of SOC15, the digital result is placed in this bit field." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB1RESULT" acronym="ADC_RESULTS_ADCPPB1RESULT" offset="32" width="32" description="ADC Post Processing Block 1 Result Register.">
		<bitfield id="SIGN" width="16" begin="31" end="16" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16.  NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." range="31:16" rwaccess="R"/>
	<bitfield id="PPBRESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block Result 1  The result of the offset/reference subtraction post conversion processing is stored in this register.   This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results [in order from lowest numbered PPB to highest] will each become available every 2-3 SYSCLK cycles [refer to the TRM for more detailed timing information].   If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register.  NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB2RESULT" acronym="ADC_RESULTS_ADCPPB2RESULT" offset="36" width="32" description="ADC Post Processing Block 2 Result Register.">
		<bitfield id="SIGN" width="16" begin="31" end="16" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16.  NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." range="31:16" rwaccess="R"/>
	<bitfield id="PPBRESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block Result 2  The result of the offset/reference subtraction post conversion processing is stored in this register.   This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results [in order from lowest numbered PPB to highest] will each become available every 2-3 SYSCLK cycles [refer to the TRM for more detailed timing information].   If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register.  NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB3RESULT" acronym="ADC_RESULTS_ADCPPB3RESULT" offset="40" width="32" description="ADC Post Processing Block 3 Result Register.">
		<bitfield id="SIGN" width="16" begin="31" end="16" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16.  NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." range="31:16" rwaccess="R"/>
	<bitfield id="PPBRESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block Result 3  The result of the offset/reference subtraction post conversion processing is stored in this register.   This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results [in order from lowest numbered PPB to highest] will each become available every 2-3 SYSCLK cycles [refer to the TRM for more detailed timing information].   If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register.  NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB4RESULT" acronym="ADC_RESULTS_ADCPPB4RESULT" offset="44" width="32" description="ADC Post Processing Block 4 Result Register.">
		<bitfield id="SIGN" width="16" begin="31" end="16" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16.  NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the SIGN bits extend down to bit 12, and all reflect the same value as bit 12." range="31:16" rwaccess="R"/>
	<bitfield id="PPBRESULT" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block Result 4  The result of the offset/reference subtraction post conversion processing is stored in this register.   This result is available 1 SYSCLK cycle after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 1 SYSCLK cycle after the associated ADCRESULT and subsequent results [in order from lowest numbered PPB to highest] will each become available every 2-3 SYSCLK cycles [refer to the TRM for more detailed timing information].   If ADCINTFLG is polled to determine when to read the PPBRESULT, it may be necessary to add one or more NOP instructions to ensure that the updated post conversion processing result has posted to the register.  NOTE: If the conversion associated with this Post Processing Block is a 12-bit conversion, the PPBRESULT bits are limited to bits 12:0." range="15:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB1SUM" acronym="ADC_RESULTS_ADCPPB1SUM" offset="48" width="32" description="ADC PPB 1 Final Sum Result Register.">
		<bitfield id="SIGN" width="8" begin="31" end="24" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 23." range="31:24" rwaccess="R"/>
	<bitfield id="SUM" width="24" begin="23" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Final Sum. When either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event, the value of PSUM is loaded into this register.  In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion.   The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register.  This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="23:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB1COUNT" acronym="ADC_RESULTS_ADCPPB1COUNT" offset="52" width="16" description="ADC PPB1 Final Conversion Count Register.">
		<bitfield id="COUNT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Final Count. When either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event, the value of PCOUNT is loaded into this register.  This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB2SUM" acronym="ADC_RESULTS_ADCPPB2SUM" offset="56" width="32" description="ADC PPB 2 Final Sum Result Register.">
		<bitfield id="SIGN" width="8" begin="31" end="24" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 23." range="31:24" rwaccess="R"/>
	<bitfield id="SUM" width="24" begin="23" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Final Sum. When either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event, the value of PSUM is loaded into this register.  In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion.   The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register.  This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="23:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB2COUNT" acronym="ADC_RESULTS_ADCPPB2COUNT" offset="60" width="16" description="ADC PPB2 Final Conversion Count Register.">
		<bitfield id="COUNT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Final Count. When either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event, the value of PCOUNT is loaded into this register.  This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB3SUM" acronym="ADC_RESULTS_ADCPPB3SUM" offset="64" width="32" description="ADC PPB 3 Final Sum Result Register.">
		<bitfield id="SIGN" width="8" begin="31" end="24" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 23." range="31:24" rwaccess="R"/>
	<bitfield id="SUM" width="24" begin="23" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Final Sum. When either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event, the value of PSUM is loaded into this register.  In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion.   The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register.  This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="23:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB3COUNT" acronym="ADC_RESULTS_ADCPPB3COUNT" offset="68" width="16" description="ADC PPB3 Final Conversion Count Register.">
		<bitfield id="COUNT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Final Count. When either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event, the value of PCOUNT is loaded into this register.  This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB4SUM" acronym="ADC_RESULTS_ADCPPB4SUM" offset="72" width="32" description="ADC PPB 4 Final Sum Result Register.">
		<bitfield id="SIGN" width="8" begin="31" end="24" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 23." range="31:24" rwaccess="R"/>
	<bitfield id="SUM" width="24" begin="23" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Final Sum. When either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event, the value of PSUM is loaded into this register.  In the case of a count-match event, the sum loaded into this register includes the value from the most recent conversion.   The value from PSUM will be right shifted by the amount specified in the SHIFT register before being loaded into the final SUM result register.  This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="23:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB4COUNT" acronym="ADC_RESULTS_ADCPPB4COUNT" offset="76" width="16" description="ADC PPB4 Final Conversion Count Register.">
		<bitfield id="COUNT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 4 Oversampling Final Count. When either a count-match event occurs [PCOUNT = LIMIT] or PPB4 receives a sync. event, the value of PCOUNT is loaded into this register.  This result is available 1 SYSCLK cycle after the associated ADCPPB4RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB4RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB1MAX" acronym="ADC_RESULTS_ADCPPB1MAX" offset="80" width="32" description="ADC PPB 1 Final Max Result Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="MAX" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Final Max. When either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event, the value of PMAX is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available [only when a count-match event occurs].  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information].  " range="16:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB1MAXI" acronym="ADC_RESULTS_ADCPPB1MAXI" offset="84" width="16" description="ADC PPB 1 Final Max Index Result Register.">
		<bitfield id="MAXI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Final Index of the Max. When either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event, the value of PMAXI is loaded into this register.  In the case of a count-match event, the max index loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB1MIN" acronym="ADC_RESULTS_ADCPPB1MIN" offset="88" width="32" description="ADC PPB 1 Final Min Result Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="MIN" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Final Min. When either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event, the value of PMIN is loaded into this register.  In the case of a count-match event, the max loaded into this register includes the value from the most recent conversion.   This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available [only in case of a count-match event]. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_RESULTS_ADCPPB1MINI" acronym="ADC_RESULTS_ADCPPB1MINI" offset="92" width="16" description="ADC PPB 1 Final Min Index Result Register.">
